[
{
  "model": "releases.release",
  "pk": 4,
  "fields": {
    "title": "Selected Ambient Works 85-92",
    "release_year": 1992,
    "artwork": "https://f4.bcbits.com/img/a1573754732_10.jpg",
    "description": "Originally released via the R&S Ambient sub-label Apollo in '92 and repressed more times than anyone could even begin to keep a count of, Aphex Twin's Selected Ambient Works 85-92 is not only one of the most important releases in both the Aphex catalogue but also electronic music as an entire entity.\r\n\r\nA richly woven tapestry of blissful sounds that offer the listener new surprises, twists and turns no matter how many times they venture through its cosmos. The techno equivalent of mainlining serotonin, Selected Ambient Works 85-92 should be prescribed on a daily dose twice a day for any and everyone reading this...",
    "buy_link": "https://bleep.com/release/21887-aphex-twin-selected-ambient-works-85-92",
    "artist": 2,
    "label": 2,
    "tags": [
      3
    ],
    "favourited_by": [
      2
    ]
  }
},
{
  "model": "releases.release",
  "pk": 6,
  "fields": {
    "title": "The Untuning Of The Sky",
    "release_year": 2013,
    "artwork": "https://f4.bcbits.com/img/a1619013527_10.jpg",
    "description": "Sarah Davachi is a composer steeped in the electronic music tradition. Not only did she study at electronic music hub Mills College, she completed post-grad programs at STEIM and Banff. The work on The Untuning of the Sky reflects her pursuits. Every piece on this record is sculpted, carefully considered, a distillation even. Davachi makes a point to seek out rare and unique synthesizers and keyboard instruments - The Untuning… features sounds from ARP, Buchla, Serge and a Mellotron. She gets to know her instruments intimately, offering us concentrated synthesizer timbres slowly circling around each other, fragments of melodies occasionally bubbling above the surface. Though she has been active in the Bay Area music scene, The Untuning of the Sky is Davachi's first official release.",
    "buy_link": "https://fullspectrumrecords.bandcamp.com/album/the-untuning-of-the-sky",
    "artist": 4,
    "label": 4,
    "tags": [
      3
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 7,
  "fields": {
    "title": "Ecstatic Computation",
    "release_year": 2019,
    "artwork": "https://f4.bcbits.com/img/a4255192498_10.jpg",
    "description": "Following 2017’s acclaimed 2LP “Patterns of Consciousness”, “Ecstatic Computation” is the new full-length LP by Caterina Barbieri. The album revolves around the creative use of complex sequencing techniques and pattern-based operations to explore the artefacts of human perception and memory processes by ultimately inducing a sense of ecstasy and contemplation. Computation is turned from being a formal, automatic writing technique into a creative, psychedelic practice to generate temporal hallucinations. A state of trance and wonder where the perception of time is distorted and challenged. Equally nervous and ecstatic, the fast permutation of patterns can create a state where time stands still whilst simultaneously being in motion. Is this propulsive music moving forward or backward? As long as the perception of the present is constantly enhanced and refreshed in an endless sense of loss, re-discovery and the search for self-orientation this question lies mute aside the thrilling and perplexing moment of the matter at hand.",
    "buy_link": "http://editionsmego.com/release/EMEGO-259",
    "artist": 5,
    "label": 5,
    "tags": [
      3
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 8,
  "fields": {
    "title": "Two Orb Reel",
    "release_year": 2017,
    "artwork": "https://assets.boomkat.com/spree/products/429537/large/33753434810054.jpeg",
    "description": "Robert Aiki Aubrey Lowe follows up his Kulthan pearl for Latency (go check this one, we can’t get enough of it!) with an absorbingly wistful and coolly suggestive sound inside, knitting raw electricity into a series of impeccably refined and chamber-considered vignettes that leave lots to the imagination.\r\n\r\nBlessed with a sense of rhythmic cadence and controlled ballistics that sets his music apart from the now swelling modular milieu, Robert Lowe coaxes out his machines’ spirits and voices with the touch of a industrial era illusionist who has just realised how to spellbind crowds with the “magic” of electricity, enabling him to soundtrack, as the label puts it, “emotions of wonder, fear and transcendence.” OK, we’re not wide eyed Victorians with pagan beliefs in the supernatural (well, then again…), but records like this one certainly do challenge the mundane logic of any more skeptical listeners as to the existence of something “other” when it comes to electronic music.\r\n\r\nIn 14 parts ranging from sub 1-minute mysteries to more expansive tracts of uniquely metered plong offset with curdled melodic and harmonic developments, the allure, as with much of Lowe’s music, lies in the way he naturally bridges those aspects so that everything moves in viscous union to extrude your head through the maze. And in the classic sense of African rhythmelodic musics, there are no ‘tricks’ or ‘drops’ - effectively spectacles - to speak of, instead placing focus on the journey or the ‘trek’ and insisting the listener is both physically and mentally rolled around inside their structures, fluidly engaging one’s proprioceptions in a way that bypasses or at least smudges what are putatively western-rooted compositional conventions.",
    "buy_link": "https://robertaikiaubreylowe.bandcamp.com/album/two-orb-reel",
    "artist": 6,
    "label": 6,
    "tags": [
      3
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 9,
  "fields": {
    "title": "Somewhere Decent To Live",
    "release_year": 2018,
    "artwork": "https://f4.bcbits.com/img/a1137618719_10.jpg",
    "description": "\"Ambient duo Space Afrika offer a bird’s eye view of the city centre at night with Somewhere Decent To Live; their keenly anticipated first LP on sferic. Unshackled from dancefloor needs, but still inspired and feeding off its spirit and romance, the pair respectfully acknowledge the undercurrents of Jungle, dubstep, ambient techno and deep house which feed into their home city’s late night economy, dowsing their tributaries back to dub and rendering the findings in a quiet, modestly lush ambient haze with a flawlessly anaesthetising effect.\r\n\r\nTaking gaseous form as a series of dark blue hues and electromagnetic subbass impulses, the vibe inside is delectably elusive. Unlike their previous transmissions on Where To Now? and Köln’s LL.M., the pair’s dancefloor urges are dissolved in favour of suggestively mutable ambient frameworks this time, leaving the kicks in the club whilst they appear to float overhead like the dead kid embarking his Bardo in Gaspar Noé’s Enter The Void.\r\n\r\nIn firm but gentle style they feel out eight interlinked headspaces, drifting like spectral flanneurs from the Diversions-like opener uwëm/creãtiõn to intercept telepathic thoughts from Teutonic friends in the percolated subs and drizzly ambient clag of sd/tl, before arriving at the most arresting moment in their catalogue thus far with the masterfully widescreen yet immersive bly and its sublimely smeared timbral thizz.\r\n\r\nThe 2nd half of the record subsequently describes a more inward journey from wistful loops in u+00B1 to the sylvan 2-step of gwabh and curve feat. Echium, ultimately culminating in the echo chamber melt of dred.\"",
    "buy_link": "https://sferic.bandcamp.com/album/somewhere-decent-to-live",
    "artist": 7,
    "label": 7,
    "tags": [
      3
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 10,
  "fields": {
    "title": "Look Up Sharp",
    "release_year": 2019,
    "artwork": "https://f4.bcbits.com/img/a3854602498_10.jpg",
    "description": "Carla Dal Forno drops the eagerly-awaited follow-up to her 2016 debut LP You Know What It’s Like through her own Kallista Records. On Look Up Sharp we find Dal Forno dealing in obfuscation and confusion once again to create an album that hovers in the space between harmony and dissonance, the obtuse and the transparent.\r\n\r\nLook Up Sharp draws from a wide variety of artists and genres. Hype Williams, Midori Takada, early trip-hop, Low, early Brian Eno, minimal synth and electronic post-punk are just a few of the sonic touchstones found across the record. While this may seem like a relatively disparate spread of styles, Dal Forno yokes them all together in a sort of dreamstate. Cloaked in reverb and laced with dubwise production techniques, the tracks of Look Up Sharp are designed to lull the listener into an uneasy reverie.\r\n\r\nWhile there are a fair few instrumentals here some of these tracks are loosely tethered to Dal Forno’s voice in order to prevent them from floating away into the ether. Aside from the relatively clear-headed ‘So Much Better’ - a song which wouldn’t sound out of place on The Velvet Underground & Nico, by the way - Dal Forno’s singing largely remains towards the back of the mix. Draping her impassive, woozy singing over cuts like ‘Leaving For Japan’ only serves to heighten Look Up Sharp’s air of uncanniness.\r\n\r\nCarla Dal Forno’s Look Up Sharp is a bewitching record, one that you can’t help but be drawn into.",
    "buy_link": "https://carladalforno.bandcamp.com/album/look-up-sharp",
    "artist": 8,
    "label": 8,
    "tags": [
      3
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 11,
  "fields": {
    "title": "Workaround",
    "release_year": 2020,
    "artwork": "https://f4.bcbits.com/img/a3649766278_10.jpg",
    "description": "The infectious draw of Beatrice Dillon’s Workaround comes from a prolonged time of tinkering and reformulating sound as it exists. It’s a debut that not only sticks to an unconventional agenda but shows a devotion to moving the genre of techno into another realm.\r\n\r\nBeatrice Dillon has long experimented with widening her electronic scope, but Workaround is an LP that takes into consideration its roots. Seen tipping her hat to iconic names like Throbbing Gristle, Shinichi Atobe, and even bits of Aphex Twin, Dillon offers an intriguingly straightforward approach to influence that retains her very own personal stamp right in its center.\r\n\r\nDillon’s no stranger to the idea of risk in her music. With a slew of releases under her belt, it comes as no surprise that she’s bound to venture off into different avenues. Therefore, as she’s well-equipped to test new waters without obscuring her essence, and Workaround shows her as grounded as ever. Embracing chic elements of avant-garde and body-moving techno, her debut remains clear-cut, her songs fashioned around sharp, enunciated thuds.",
    "buy_link": "https://beatricedillon.bandcamp.com/album/workaround",
    "artist": 9,
    "label": 9,
    "tags": [
      3
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 12,
  "fields": {
    "title": "Lux",
    "release_year": 2021,
    "artwork": "https://f4.bcbits.com/img/a0333629621_10.jpg",
    "description": "Venus Ex Machina’s Lux is an album which moves between widescreen electronic sound design, ominous dark ambiences and driving rhythm tracks that pitch up in various leftfield techno outposts.\r\n\r\nAt its most immediate, Venus Ex Machina’s music runs with the same experimental club spirit that one finds in explored by labels like NON Worldwide and Hyperdub - both imprints Venus Ex Machina has been involved with in her time. ‘Elephant’ and ‘Nachtspiel’ blend whirring polyrhythms with darkside takes on dub-techno atmospherics to propulsive, hypnotic effect. Some of the other club-adjacent productions of Lux are more boldly confrontational - there is both gqom and the Fade To Mind style to be found in the drum programming of ‘Grace’ while the metallic mid-tempo strut of ‘Mysterium’ comes close to EBM.\r\n\r\nLux’s rhythm-centred joints are made all the more notable for their juxtaposition with the record’s more abstract, shadowy numbers. The LP is bookended by two tracks which largely eschew percussion and journey into strange, surreal electronic hinterlands, while the warping half-time of ‘Blood Moon (Solar Mix)’ switches up the pace of Lux in its midsection.\r\n\r\nVenus Ex Machina debuts on AD 93 with a collection of bold and bracing electronic innovations.",
    "buy_link": "https://ad93.ltd/",
    "artist": 10,
    "label": 10,
    "tags": [
      3,
      11
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 13,
  "fields": {
    "title": "Love Discipline",
    "release_year": 2018,
    "artwork": "https://f4.bcbits.com/img/a1286800489_10.jpg",
    "description": "Love Discipline builds on the haunted aesthetic of Debit’s LP Animus, presenting a 5-part opera of futuristic, cinematic & sinister sound works. Within this tape are moments of dissonance and harmony, chaos and flowing movement. Largely beat-less but not ambient in the traditional sense; Love Discipline invites you to listen actively, and let it pulverize at high volume. Love Discipline is inspired by the work of psychoanalyst Erich Fromm, who believed that love can be analyzed, taught and practiced, like a discipline.",
    "buy_link": "https://quiettimetapes.bandcamp.com/album/love-discipline-qtt11",
    "artist": 11,
    "label": 11,
    "tags": [
      3
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 14,
  "fields": {
    "title": "Zoom",
    "release_year": 2020,
    "artwork": "https://f4.bcbits.com/img/a0956424764_10.jpg",
    "description": "The natural world has long been forced to reckon with an expanding human influence across its surface. Is mechanisation incompatible with the splendor of nature? Lean in close to the music of upsammy and find out how beauty and the blur can exist in harmony.\r\n\r\nZoom is Thessa Torsing’s first full-length album as upsammy. Since 2017, she has developed a signature style in front of listeners eyes and ears: hers is a mesh of airy tones, tender melodies and highly technical drum patterns which wrap around the body of the song like colourful thread around a metallic spindle. Zoom, a refinement of her sound and an expansion of its ambition, is evidently electronic yet seems to float some way off beyond the glow of a screen. “I don’t like it when something sounds stiff,” upsammy says. “If electronica is super sharp, quantized, hi-fi-ized, this is kind of logical; it is a computer after all. But then, for me, all the emotion is removed. I like little imperfections.”",
    "buy_link": "https://dekmantel.com/shop/records/upsammy-zoom",
    "artist": 12,
    "label": 12,
    "tags": [
      3,
      10
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 15,
  "fields": {
    "title": "Angel's Flight",
    "release_year": 2021,
    "artwork": "https://f4.bcbits.com/img/a1613733754_10.jpg",
    "description": "Angel’s Flight is the new album from highly-acclaimed producer and composer Biosphere, set for release on vinyl and CD in January 2021.\r\n\r\nIt features twelve tracks based on Beethoven’s String Quartet No. 14 that deftly tread the peripheries of classical and electronic composition.\r\n\r\nMuch of the music was initially composed for Uncoordinated Dog, a dance production by the Ingun Bjørnsgaard Prosjekt in 2019 that explored the personal, the ambiguous, exposure and beauty – which gives you a sense of what the album holds.",
    "buy_link": "https://ad93.ltd/",
    "artist": 13,
    "label": 10,
    "tags": [
      3,
      10
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 16,
  "fields": {
    "title": "Hubris Variation",
    "release_year": 2016,
    "artwork": "https://f4.bcbits.com/img/a3941766350_10.jpg",
    "description": "Oren Ambarchi gets the very best out of Ricardo Villalobos by tasking the veteran Chilean rhythmatician with emphasising the rhythmic backbone he produced for Ambarchi’s Hubris album.\r\n\r\nIn one of those every-few-year spikes of genius we see from Ricky V, he goes microscopic on the levels of insectoid, Afro-latin groove mechanics, tweaking ever bar into an organic twist and resolution of the last in an achingly tight yet loose, micro-to-macro masterstroke that sounds something like Beatrice Dillon reworking This Heat. Or, then again, it just sounds like Ricardo Villalobos through and through.\r\n\r\nWe’d love to hear a DJ play this in full, but we’ll probably have to make do with shuffling around to it while making dinner. Highly recommended either way.",
    "buy_link": "https://boomkat.com/products/hubris-variation",
    "artist": 14,
    "label": 13,
    "tags": [
      4
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 17,
  "fields": {
    "title": "Cosmic Transmission",
    "release_year": 2020,
    "artwork": "https://f4.bcbits.com/img/a1128404085_10.jpg",
    "description": "Ilian Tapes bosses Dario and Marco Zenker return with more minimal techno experimentalism on their long-awaited second LP. But there hasn’t exactly been a dearth of Zenker Brothers releases lately; the road to Cosmic Transmission has been dotted with a string of dubby deep space techno micro-manifestos they refined with 2020’s Mad System. Now, their austere yet open-armed sonics reach a zenith with the sloping bass slides of ‘Intense Incense’ and the all-out cybernetic ambience of ‘Natural Connection’. Beats snake their way back into the intergalactic plateaus of ‘When Nothing Is Safe’, developing lightly acidic tones on the likes of ‘Sphere Force’.",
    "buy_link": "https://iliantape.de/itlp07-zenker-brothers-cosmic-transmission/",
    "artist": 15,
    "label": 14,
    "tags": [
      4
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 18,
  "fields": {
    "title": "Journey Of The Deep Sea Dweller I",
    "release_year": 2011,
    "artwork": "https://f4.bcbits.com/img/a4021342741_10.jpg",
    "description": "Drexciya might need an introduction for some, for others it is the most influential techno project ever. \r\n\r\nPart of the heritage of Detroit's Underground Resistance, Drexciya explored techno music like no-one else before. Raw and uncompromising music that reflects the harsh environment of the city where Drexciya was conceived. The aesthetics and the mythical approach combined with the unique music made this one of the biggest cult projects in techno music. Drexciya arguably stands for the darker side of techno and electro, music not only made for the club scene, but a further development of the music as an expression and extension of the mind. 20 years after the release of ''Deep Sea Dweller'' (their first release), and 10 years after ''Grava 4'' (their last), we present ''Journey Of The Deep Sea Dweller''.\r\n\r\nThis series is an almost complete collection of their early works, and is remastered from the original master tapes. Since the original releases have such a strong character, appeal and stand on their own, this re-issue can never re-create the magic of those originals. So instead we stirred up the catalogue taking the tracks out of their original context, giving the 'in the know' listener a fresh experience and the new listener a document that is the best possible introduction to the aquatic world of Drexciya.",
    "buy_link": "https://clone.nl/item21960.html",
    "artist": 16,
    "label": 15,
    "tags": [
      4
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 19,
  "fields": {
    "title": "Middle Ouest",
    "release_year": 2020,
    "artwork": "https://f4.bcbits.com/img/a1589039402_10.jpg",
    "description": "After a digital single on Optimo Music Digital Danceforce, Optimo Music welcomes Bergsonist to the main label with a full album. Ridiculously talented and prolific, Bergsonist is one of thee most interesting, thoughtful and important artists of our times.\r\n\r\nBergsonist aka Selwa Abd is a New York–based artist and musician originally from Morocco.She is the founder of Bizaarbazaar, a music platform and publication that publishes podcasts and interviews by DJs and producers from around the world. Under the guise Bergsonist (derived from Deleuze's Bergsonism), she uses a variety of media to investigate social resonance through divergent conceptual aesthetics (minimalism, techno, and music concrete, to name a few). Through her work, she explores notions of identity, memory, and social politics.\r\n\r\nIn 2017, she started Pick Up The Flow, a resource to promote congregation and exchange between peers. Currently, co-run with Stephen Decker.\r\n\r\nIn 2019, she co-founded 3afak with DJ Sanna, a collective that aims to empower Arab women’s creative vision in New York.",
    "buy_link": "https://bergsonist.bandcamp.com/album/middle-ouest",
    "artist": 17,
    "label": 16,
    "tags": [
      4
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 20,
  "fields": {
    "title": "Josey In Space",
    "release_year": 2020,
    "artwork": "https://f4.bcbits.com/img/a3238075294_10.jpg",
    "description": "Josey Rebelle proves what all the fuss is about on her killer rag around UK hardcore, jungle, Detroit techno, jazz and up-to-the-minute electronics for BiS.\r\n\r\nHarvesting tracks by everyone from Afrodeutsche to Titonton Duvante and Loraine James, Rebelle works up some wicked friction thru restless permutations of pattern between house, techno, jungle, electro, breaks and dashes of poetry and jazz-wise madness.\r\n\r\nIt’s the sort of mix that's best taken in one, but we have to highlight her use of Rum & Black’s ruthless hardcore barnstormer ‘Zombies At Dawn’, Brassfoot’s nasty hammer ‘Kingu’s Sceptre’, and the rude broken beat torque of Access 58’s ‘Jazz Drama’.",
    "buy_link": "https://beatsinspace.net/records/bis045/",
    "artist": 18,
    "label": 17,
    "tags": [
      4,
      10
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 21,
  "fields": {
    "title": "canufeelthesunonyrback",
    "release_year": 2019,
    "artwork": "https://f4.bcbits.com/img/a2634190678_10.jpg",
    "description": "There was an aging writer called Mortise Koshimitsu who lived in a small apartment. The apartment was beset with problems. It was damp, the wiring was frail and in the summer the leaking pipes added a must and swelling to the wood in the windows that effectively countered the joys of the heat. Koshimitsu’s life had been lived chiseling away at circumstance, and circumstances had not proved easy. There was however, one small reliable rush to be had, and it lay through a gloomy doorway, down some stairs and past a register",
    "buy_link": "https://www.rushhour.nl/record/vinyl/canufeelthesunonyrback",
    "artist": 19,
    "label": 18,
    "tags": [
      4
    ],
    "favourited_by": [
      2
    ]
  }
},
{
  "model": "releases.release",
  "pk": 22,
  "fields": {
    "title": "Phylyps Trak II",
    "release_year": 1994,
    "artwork": "https://img.discogs.com/DooiUkl5UcJPHkKFBcjDd8Wa3E4=/fit-in/591x600/filters:strip_icc():format(jpeg):mode_rgb():quality(90)/discogs-images/R-2167-1128948054.jpeg.jpg",
    "description": "Foundational techno business from 1993, documenting Mark and Moritz pelting ‘em out live at 145bpm at Waschhaus, Potsdam and setting the template for a whole genre for 3 decades (and counting) to come.\r\n\r\nThe titular A-side is a monstrous minimalist pounder built for maximalist effect; drop it at the right time and the effect is intensely powerful. On the B-side ‘Phylyps Base’ is a more concise version giving more room for the low end to boom out, and ‘Axis’ focuses on martial 909 percussion in a very Millsian or UR style.\r\n\r\nEvery home should own a copy!",
    "buy_link": "https://hardwax.com/04810/basic-channel/phylyps-trak-ii/",
    "artist": 20,
    "label": 19,
    "tags": [
      4
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 23,
  "fields": {
    "title": "Magnetic Service",
    "release_year": 2020,
    "artwork": "https://f4.bcbits.com/img/a0032835862_10.jpg",
    "description": "Livity Sound present the 'Magnetic Service' EP from Azu Tiwaline exploring the intersections of Amazigh music, dub culture and techno hypnosis across four mesmerising tracks. Fresh from the acclaimed Draw Me a Silence LP on IOT Records and collaborating with musician and sound artist Cinna Peyghamy, this new record further explores the hypnotic percussion and mystique of the Tunisian Sahara, a hybrid sound playing on contrasts and nuances, light and dark with echoes of techno minimalism and modern dub.",
    "buy_link": "https://azutiwaline.bandcamp.com/album/magnetic-service-e-p",
    "artist": 21,
    "label": 20,
    "tags": [
      4
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 24,
  "fields": {
    "title": "006",
    "release_year": 2016,
    "artwork": "https://f4.bcbits.com/img/a1821820265_10.jpg",
    "description": "The artwork for Avalon Emerson's Whities debut depicts an Amiga-esque desert of blues, creams and reds, which gives the scene an exotic, even alien appearance. The music also seems to reappraise that environment. Deserts tend to inspire thoughts of desolation and sweltering toil, but Whities 006 is a wistful ode to Emerson's upbringing in Arizona.\r\n\r\nShe paints a loving portrait, but there's grit and sweat underneath. Bass notes gallop endlessly across \"The Frontier,\" as if carrying the maudlin synth melody through the Mojave, and shakers labour intensely over the beat. With the rhythm gone, the \"High Desert Synthapella\" version of \"The Frontier\" sounds downcast. The bassline gave the original track a series of encouraging jolts, so its absence allows Emerson's synths to drift and disperse into nothingness. These two tracks reflect the yearning that can come with fond memories of childhood—Whities 006 isn't just affectionate, it can feel homesick, too.\r\n\r\n\"2000 Species Of Cacti\" has the bouncy, knocking rhythm of another Whities record, Kowton's excellent Whities 002. The track's drums snap at a scorched, buzzy synth, before a luminous melody shines overhead like falling stars. It fits snugly into Whities 006's theme, evoking the deserts of the American Southwest as a source of joy and wonderment rather than a lifeless, unforgiving plain.",
    "buy_link": "https://ad93.ltd/",
    "artist": 22,
    "label": 10,
    "tags": [
      4
    ],
    "favourited_by": [
      2
    ]
  }
},
{
  "model": "releases.release",
  "pk": 25,
  "fields": {
    "title": "EP3",
    "release_year": 2020,
    "artwork": "https://f4.bcbits.com/img/a3174574147_10.jpg",
    "description": "Welcome to the fourth pathway in the journey of AceMoMA. Once again you are invited into our room of sound. Each time the door is open, we inch closer. We thank you for joining us thus far. As always, we are just getting started. - AceMoMA",
    "buy_link": "https://acemomabk.bandcamp.com/",
    "artist": 23,
    "label": 21,
    "tags": [
      4
    ],
    "favourited_by": [
      2
    ]
  }
},
{
  "model": "releases.release",
  "pk": 26,
  "fields": {
    "title": "Tack EP",
    "release_year": 2019,
    "artwork": "https://f4.bcbits.com/img/a3588831011_10.jpg",
    "description": "The subversive electronics duo is back at it again for the sixth release on Planet Euphorique. Ambien Baby brings you another slab of total sonic disorientation, the good kind; the one that invites you to dance, but also questions the stifling boundaries of genre within electronic music. Dreaming up a sound that welcomes confusion and experimentation. A spectrum of colour and vibes; electro, experimentalism, and primal sensibilities mash and clash in an odd harmony.",
    "buy_link": "https://planeteuphorique.bandcamp.com/album/tack-2",
    "artist": 24,
    "label": 22,
    "tags": [
      4
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 27,
  "fields": {
    "title": "Exorcise The Demons",
    "release_year": 1999,
    "artwork": "https://images-eu.ssl-images-amazon.com/images/I/317275S0YJL._AC_UL600_SR600,600_.jpg",
    "description": "An almost uncompromisingly dark album, Source Direct's 'Exorcise the Demons' provokes a similar reaction to Photek's 'Modus Operandi' opus, a long-player with which it shares a number of relevant affinities. Both can be viewed essentially as journeys into the dark realms of progressive drum & bass, narrowing their authors' previous emotionally wider perspectives in favour of a more monolithic endeavour. Both include a couple of tracks that feel somewhat redundant in the overall context. And both fail to dissipate a slight but inescapable feeling of disappointment, when compared to their authors' previous impressive body of work. And yet… they're still among the genre's best long players.\r\n\r\nRunning through the album's track list, there’s not a single weak moment to be found here. Quite a few pieces are among Source Direct's best ever: the martial groove of 'Call & Response' (previously released as a 12'' and CD single), the dual concept of 'Love & Hate', the eerie and almost orchestral 'Capital D' (also previously released), the somber and anguished trip of 'Wanton Conduct' and above all 'Mind Weaver', with its cut up amen breaks and aggressive flash effects producing a tense, almost paranoid atmosphere, with devastating impact. Also deserving notice is the rather unusual percussive, dancefloor driven 'Dubstar', a tribal dub influenced track that even if not completely accomplished provides a new dimension to Source Direct's grand scheme.",
    "buy_link": "https://www.discogs.com/Source-Direct-Exorcise-The-Demons/master/126685",
    "artist": 25,
    "label": 23,
    "tags": [
      5
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 28,
  "fields": {
    "title": "Natural Born Killa",
    "release_year": 1995,
    "artwork": "https://f4.bcbits.com/img/a2389495445_10.jpg",
    "description": "Absolute stone cold classic from Photek that broke boundaries back in 1994/5. Every track is a timeless classic but it's the enduring 'Into the 90s' that still has that special charm. Essential!!",
    "buy_link": "https://metalheadz.bandcamp.com/album/natural-born-killa-ep-2015-remasters",
    "artist": 26,
    "label": 24,
    "tags": [
      5
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 29,
  "fields": {
    "title": "Terminus EP",
    "release_year": 2020,
    "artwork": "https://f4.bcbits.com/img/a3636491375_10.jpg",
    "description": "One of the best at warping D&B and deep techno, Forest Drive West rinses four subaquatic twysters for R&S and fans of Sully, Source Direct, UVB-76 Music.\r\n\r\nWith 2018’s debut LP ‘Apparitions’ and ace 2019 turns for techno labels Whities, Echocord and Delsin in his rearview, London’s FDW both ruffs up and refines his sleek, rolling heft to deeply hypnotic degrees on the ‘Terminus EP’.\r\n\r\n‘Impulse’ rolls out a battery of possessed percussion and snarling neuro licks like Ruffhouse meets 33EMYBW, where ‘Terminus’ follows with needling juke patterns and rolling subs swarmed by disembodied sound design. ‘Void Control’ ices the mood to something like Mika Vainio stepping off with Pessimist, and the transition from cinematic drone into swingeingly tight 2-step and jungle rollige in ‘Curved Path’ surely marks out a new high water mark in his catalogue.",
    "buy_link": "https://boomkat.com/products/terminus-ep",
    "artist": 27,
    "label": 2,
    "tags": [
      5
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 30,
  "fields": {
    "title": "The Tao",
    "release_year": 2020,
    "artwork": "https://f4.bcbits.com/img/a3702992238_10.jpg",
    "description": "Observed in Taoism as its defining principle and an underlying force running concurrently throughout the universe, ‘Tao’ signifies the words ‘way’, ‘path’ or ‘route’. The Tao also signals the continuing adventures of Donato Dozzy within and beyond techno. Having switched gears to move at the 170 bpm benchmark on Samurai Music in 2019, Dozzy’s opening gambit with The Tao is the rapidly accelerating rhythm of ‘Mai’, seemingly moving outside of lock-step and into further realms far off grid. ‘Dusty Bones’ similarly tickles the faster end with restless toms and billowing swells of bass, later descending into a flurry of discordant screeches.",
    "buy_link": "https://bleep.com/release/210835-donato-dozzy-the-tao",
    "artist": 28,
    "label": 25,
    "tags": [
      5
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 31,
  "fields": {
    "title": "DJ-Kicks",
    "release_year": 1999,
    "artwork": "https://d1rgjmn2wmqeif.cloudfront.net/r/b/187514.jpg",
    "description": "A reissue of an absolutely definitive volume here. This new edition of Kemistry & Storm’s DJ-Kicks instalment is also something of an anniversary - 2020 marks (a little more than) two decades since the mix first hit the market and a quarter-century since !K7 kicked off the series as a whole. It still sounds as magnificent as ever, both a time-capsule from a point when the Metalheadz label they ran had established itself as the go-to for dark, futuristic drum ‘n’ bass and also a timeless ode to junglism and its attendant cultures. Though Kemistry tragically passed away before the new millennium came, this DJ-Kicks volume remains testament to a whole scene that came up in the image of her and Storm.",
    "buy_link": "https://k7records.bandcamp.com/album/dj-kicks-kemistry-storm",
    "artist": 29,
    "label": 26,
    "tags": [
      5
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 32,
  "fields": {
    "title": "LEVL #2",
    "release_year": 2020,
    "artwork": "https://f4.bcbits.com/img/a0047612020_10.jpg",
    "description": "Fantastic Ambient Drum & Bass research & development by dream team DB1, Felix K & Forest Drive West.",
    "buy_link": "https://levl.bandcamp.com/album/levl-2",
    "artist": 30,
    "label": 27,
    "tags": [
      5
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 33,
  "fields": {
    "title": "Trinity Ville / Dead Peak",
    "release_year": 2016,
    "artwork": "https://f4.bcbits.com/img/a2833107857_10.jpg",
    "description": "",
    "buy_link": "https://cylonrecordings.bandcamp.com/album/trinity-ville-dead-peak",
    "artist": 31,
    "label": 28,
    "tags": [
      5
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 34,
  "fields": {
    "title": "Bass + Funk & Soul",
    "release_year": 2020,
    "artwork": "https://f4.bcbits.com/img/a3472193868_10.jpg",
    "description": "The story of Bass + Funk & Soul, the second album from DJ Earl, can be traced back to a trip to Brazil, where he was booked to play a festival. During his visit, Earl stayed with a promoter friend, who introduced him to Brazilian funk. \"This music was amazing!\" he said in a recent RA Exchange. As someone raised on the likes of Aretha Franklin and Barry White, he noted the similarities between this newfound music and the sounds of his childhood. Earl's quest to better understand the genre led him to a fateful moment, when the same friend gifted him a hefty file of Brazilian funk samples.\r\n\r\nIn its best moments, Bass + Funk & Soul sounds like Earl trying to slow things down. Sometimes, it's even emotional. The album's closer, \"Stl Breathin,\" takes on a new meaning during a year in which many of us have lost loved ones, or faced the fragility of our own mortality due to an illness that strips your breath away. Rusty piano chords flutter off into the ether, and a melancholy voice fades like the last traces of a song emanating from a passing car.\r\n\r\nEarl's debut album heralded a shift towards a footwork sound that was more meticulously composed and palatable to off-the-dance floor listeners. Four years later, Bass + Funk & Soul is steeped in a softer palette that proves the influence of one pivotal trip to Brazil.",
    "buy_link": "https://djearlteklife.bandcamp.com/album/mtxlt190-bass-funk-soul?from=embed",
    "artist": 32,
    "label": 29,
    "tags": [
      5
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 35,
  "fields": {
    "title": "Dark Lotus",
    "release_year": 2017,
    "artwork": "https://f4.bcbits.com/img/a3488427871_10.jpg",
    "description": "Jlin returns with the first fruits of her new work since last years ‘Free Fall’ EP. ’Dark Lotus’ is a transition between 'Dark Energy’, her debut album, and her forthcoming ‘Black Origami’ full-length.\r\n\r\nA-side ’The Return of the Blvck Rxbbit (ft. Avril Stormy Unger)’ is the more traditional of the two tracks, starting off proceedings with a constantly switching rhythmic structure and a stop-start sweeping hoover stab panning between the speakers, descending bleeps and Avril's vocals cut into shapes and pushed through effects.\r\n\r\nB-side ‘Nyakinyua Rise’ races headlong into uncharted territory, with a fierce barrage of djembe drums over pounding bass, punchy war cries and jubilant uluations that paint a tension between hot aggression and weightless ecstasy.",
    "buy_link": "https://cargorecordsdirect.co.uk/products/jlin-dark-lotus",
    "artist": 33,
    "label": 30,
    "tags": [
      5
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 36,
  "fields": {
    "title": "Madvillainy",
    "release_year": 2004,
    "artwork": "https://f4.bcbits.com/img/a1024330960_10.jpg",
    "description": "Madvillainy is a collaboration between rapper MF Doom and producer Madlib under the group name Madvillain.\r\n\r\nMF DOOM and Madlib were off the radar to many in 2003, but the announcement of a collaboration and the first track, “America's Most Blunted”, brought all the quiet fans out of the woodwork, and let to a controversial and highly acclaimed album release in early 2004 that helped expose the two artists to a large audience for the first time. While the producer and MC both did was what completely natural to them at the time, they turned the formula of popular rap at the time on its head, creating an album that is both unique and true to it's hip-hop influences.",
    "buy_link": "https://madvillain.bandcamp.com/album/madvillainy",
    "artist": 34,
    "label": 31,
    "tags": [
      6,
      10
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 37,
  "fields": {
    "title": "Miss E.. So Addictive",
    "release_year": 2001,
    "artwork": "https://media.pitchfork.com/photos/5929bc50c0084474cd0c2a75/1:1/w_320/cbb707b4.jpg",
    "description": "This is the third album for Missy \"Misdemeanor\" Elliott, and it again features the acclaimed production work of Timbaland. Guests include Busta Rhymes, Redman, Method Man, Ludacris, Eve, Jay-Z, and Ginuwine.",
    "buy_link": "https://www.discogs.com/Missy-Elliott-Miss-E-So-Addictive/release/176357",
    "artist": 35,
    "label": 32,
    "tags": [
      6
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 38,
  "fields": {
    "title": "Stankonia",
    "release_year": 2000,
    "artwork": "https://upload.wikimedia.org/wikipedia/en/0/0b/OutKast_-_Stankonia.JPG",
    "description": "When OutKast released its fourth studio album Stankonia, the pioneering duo out of Atlanta, Ga., was not new to this, but they remained true to the hip-hop thing. Released on Halloween 2000, months after the initial Y2K scare that left people terrified of being throttled back into a period of darkness and technological paranoia, Stankonia took full advantage of the new millennium. They stayed true to what they did best and created something powerful on the fringes of mainstream pop culture's expectations of them as southerners and as rappers. \r\n\r\nBreaking new ground cleared from the debris of nostalgia, burned with their Chonkyfire, Stankonia challenged listeners to reconsider what it meant to be OutKasted in the wilderness of an unknown new world. Never ones to shy away from the stank of imagined and social-historical realities, Stankonia is a demonstration of André Benjamin and Big Boi evolving their sound, their identities, and their art. Benjamin was blasting centuries ahead with his latest moniker, André 3000, an Afrofuturist prediction that the future was Black and dope as hell, and Big Boi was growing increasingly experimental in not only his lyrical delivery but his fashion sense, paralleling Benjamin's own eccentric flair for fashion.",
    "buy_link": "https://www.juno.co.uk/products/outkast-stankonia-reissue/627934-01/",
    "artist": 36,
    "label": 33,
    "tags": [
      6
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 39,
  "fields": {
    "title": "Baduizm",
    "release_year": 1997,
    "artwork": "https://www.udiscovermusic.com/wp-content/uploads/2019/02/Erykah-Badu-Baduizm.jpg",
    "description": "If there was ever a chance that neo-soul would outpace traditional R&B, Baduizm made the case before The Miseducation of Lauryn Hill and Voodoo blew the roof off the discourse.\r\n\r\nWhen Baduizm debuted on February 11, 1997, it was just as she had described, jam-packed with concepts that spoke to a higher consciousness. Lead single “On & On,” the song that first brought her to wider public attention, makes several references to the teachings of the Five Percent Nation, a cultural movement grounded in the belief that all black people are divine. A core part of the Five-Percenter doctrine revolves around the idea of the black man as God. But Baduizm was more concerned with the empowered black woman, putting her work, relationships, family values, and quest for knowledge under the lens.\r\n\r\nErykah Badu’s role in neo-soul made her a visionary of the modern soul revival, and it’s an influence that reverberates still through Janelle Monàe, Solange, D.R.A.M., and many more. But more than just representing a moment in time, Badu emerged from the neo-soul haze unscathed, with a classic debut firmly in her pocket and an unwavering drive to inspire and create.",
    "buy_link": "https://www.discogs.com/Erykah-Badu-Baduizm/release/202658",
    "artist": 37,
    "label": 34,
    "tags": [
      6
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 40,
  "fields": {
    "title": "And Yet It's All Love",
    "release_year": 2018,
    "artwork": "https://f4.bcbits.com/img/a1035460681_10.jpg",
    "description": "It's been four years since Eglo Records' Fatima released 2014's Blue Note-approved, critically acclaimed debut Yellow Memories. This September, the London- via -Stockholm, Sweden songstress, returns with her second album, And Yet It's All Love — an emotional, yet entertaining trip through the full cycle of a romantic relationship, told in Fatima's now-familiar soulful style.\r\n\r\nFrom first singles \"Somebody Else” and \"Caught In A Lie\" to \"Waltz\" and \"Just To Hold You\" — listeners are transported from first meet, the blinding honeymoon period and struggle right through to the break-up and eventual fallout. Once again, she calls on a talented array of producers and instrumentalists to paint that picture; from Stones Throw's MNDSGN, J.D Reid (Mabel, D Double E), Purist (Daupe), Taz Arnold (Kendrick Lamar), Swarvy and regular collaborator, Natureboy Flako.\r\nEarly support has already come from the likes of Gilles Peterson (BBC 6Music/Worldwide FM), Benji B (Radio 1 / 1Xtra), Toddla T, NTS Radio, Crack Magazine, Pitchfork and Resident Advisor. Up-and-coming San Francisco-based illustrator, sculptor and painter, Monica Kim Garza crafts the album artwork, placing one of her powerfully intimate nude paintings at its centre.\r\n\r\nFor the uninitiated, Fatima, has earned a reputation as one of the UK's most respected vocalists. Her debut LP Yellow Memories featured heavyweight collaborations with Floating Points, Theo Parrish and Anderson Paak producer Knxwledge. It was met with critical acclaim winning Gilles Peterson's 'Album Of The Year' at the 2014 Worldwide Awards as well as ranking No.10 in Rolling Stone Magazine's Top 20 R&B albums of the year before being re-released by the legendary Blue Note records.",
    "buy_link": "https://fatima.bandcamp.com/album/and-yet-its-all-love",
    "artist": 38,
    "label": 35,
    "tags": [
      6
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 41,
  "fields": {
    "title": "VWETO II",
    "release_year": 2019,
    "artwork": "https://i.guim.co.uk/img/media/7f368be025cf43ba315af31c4e380ff87f1ec3a8/0_0_1200_1200/master/1200.jpg?width=380&quality=85&auto=format&fit=max&s=bd57724af90ba3b4d099bd0e27a53044",
    "description": "Georgia Anne Muldrow's instrumental album, Vweto II,continues a trajectory of West Coast funk, jazz-influenced, and psychedelic beats. Highlights include the Afrofuturistic, electronic “Mary Lou’s Motherboard” and the smooth, upbeat, and funkadelic “Nate Dogg’s Eulogy,” which is a fitting tribute to the late, legendary West Coast rapper. VWETO II ends as it started with a futuristic deep funk and electronic beat on the track “Yoyo Ma fOnk.”",
    "buy_link": "https://soundsoftheuniverse.com/sjr/product/georgia-anne-muldrow-vweto-ii",
    "artist": 39,
    "label": 36,
    "tags": [
      6
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 42,
  "fields": {
    "title": "Black Mahogani",
    "release_year": 2004,
    "artwork": "https://f4.bcbits.com/img/a3006269793_10.jpg",
    "description": "Kenny Dixon, Jr.'s outspoken views on the state of black techno and his aversion to publicity put him in a league occupied by few Detroit producers other than Underground Resistance supremo \"Mad\" Mike Banks, though his tech-house productions as Moodymann are soulful in a league few could expect. Dixon began producing early in the '90s, and inaugurated his own KDJ Records in 1994 with the Moody Trax EP. Following singles like \"The Day We Lost the Soul\" and \"I Can't Kick This Feelin When It Hits\" proved one of the best fusers of short, soulful disco samples to the harder minimalist Detroit techno, and gained Kenny a 'legendry' status across Europe. Further singles for After Midnight, Music Is..., and Carl Craig's Planet E Records (including the brilliant \"Dem Young Sconies EP\") solidified Dixon's place in Detroit techno, though his stance on promotion remained firm. Much of his KDJ output appeared on 1997's \"A Silent Introduction\", while the following year's \"Mahogany Brown\" brought much new material. \"Forevernevermore\", released in 2000, collected more of his KDJ material and added several new tracks as well. \"Black Mahogani\" released in 2004 has been described by many as THE Mooodyman album and includes versions of undeniable classics such as \"Shades Of Jae\" and 'I'm Doing Fine\". A companion album released in tandem entitled \"Black Mahogani 2\" introduced Kenny's Pitch Black City sound of sublime jazz jams. Kenny is undoubtably one of the last true innovators in dance music. \\\"I don’t make music for the masses to dance to, i make music for the small majority that listens.\\\" Kenny Dixon Jr. aka Moodymann",
    "buy_link": "https://www.phonicarecords.com/product/moodymann-black-mahogani-cd-peacefrog/125939",
    "artist": 40,
    "label": 37,
    "tags": [
      4
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 43,
  "fields": {
    "title": "Bandana Beats",
    "release_year": 2020,
    "artwork": "https://images.roughtrade.com/product/images/files/000/187/152/hero/Bandana_Beats.jpg?1579195371",
    "description": "As the second collaborative album by US rapper Freddie Gibbs and dexterous record producer Madlib, 'Bandana' was a monumental hit in 2019. So much so that the pair now prepare to release the LP, an instrumental version of the record named 'Bandana Beats'. Kick back and enjoy the unvarnished and dazzling soundscapes and beats.",
    "buy_link": "https://www.normanrecords.com/records/179989-freddie-gibbs-madlib-bandana-beats",
    "artist": 41,
    "label": 38,
    "tags": [
      6
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 44,
  "fields": {
    "title": "Meet The Woo",
    "release_year": 2019,
    "artwork": "https://images.genius.com/635ff5c508733b1eba3a01ff72e5fc9e.1000x1000x1.jpg",
    "description": "The Brooklyn rapper makes good on the promise of “Welcome to the Party” with a debut full of the hardest, dirtiest tracks he can manage. Previous singles “Meet the Woo” and “Welcome to the Party” lead off the mixtape and set its sinister tone. Of the new tracks, “Scenario” comes closest to recreating their magic: Pop Smoke’s voice is harrowing and Marvel-supervillain worthy, the beat a haunted amusement park. Meet the Woo injects life into a Brooklyn drill scene that was running on fumes.",
    "buy_link": "https://www.discogs.com/Pop-Smoke-Meet-The-Woo/master/1847494",
    "artist": 42,
    "label": 39,
    "tags": [
      6
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 45,
  "fields": {
    "title": "Voodoo",
    "release_year": 2000,
    "artwork": "https://d1c4rk9le5opln.cloudfront.net/6fdf6d375d51e41398c735d0c603ed9d.jpg",
    "description": "Voodoo hit store shelves on January 25th 2000, just a few weeks after the New Year celebrations to end them all. But the first great album of the new millennium was born in the 1990s, and its muggy grooves capture the sound of premillennial anxiety. The album is the product of perfectionism, obsession and paranoia. 1995’s debut Brown Sugar had already strategically positioned D’Angelo—born Michael Eugene Archer and Virginiaraised to a Pentecostal preacher father—as the next Hendrix like deity in black music, after Prince and maybe Lenny Kravitz. But since its release, D’Angelo had become distracted by weed and weightlifting, he’d been shaken by the deaths of Tupac Shakur and The Notorious B.I.G. and debilitated by sophomore pressure. In the interim he’d fathered two children, switched managers and jumped to a new record label. Though inspired by the birth of his children and trips back to Virginia, Voodoo’s roots are in 1960s, ‘70s and ’80s funk and soul; a nostalgic nod to the ideas and inventions of black music trailblazers powered by avantgarde hiphop and jazz influenced rhythms. D’Angleo’s aim, he said, was to reclaim R&B. He wanted to be like Sly Stone, George Clinton and Al Green. And most of all, he wanted to be like Jimi Hendrix. Where does a potently focused young man go to remake Electric Ladyland? New York’s Electric Lady studios, of course: in the same rooms in which Hendrix and Stevie Wonder reinvented music decades earlier, and on the same equipment too. In an era in which soul musicians were obsessing over all things synthetic, D’Angelo was looking to the warm sounds of the past. Electric Lady’s Studio C became D’Angelo’s brand new creative laboratory.",
    "buy_link": "https://www.phonicarecords.com/product/dangelo-voodoo-lp-back-to-black/111235",
    "artist": 43,
    "label": 40,
    "tags": [
      6
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 46,
  "fields": {
    "title": "Heaven To A Tortured Mind",
    "release_year": 2020,
    "artwork": "https://f4.bcbits.com/img/a0934507009_10.jpg",
    "description": "Just over eighteen months on from the visionary success of 2018's Safe In The Hands Of Love, Yves Tumor pushes visceral sonic boundaries with his new full-length studio album Heaven To A Tortured Mind.  In a sense, Heaven To A Tortured Mind occupies the anthemic soundworld of the androgynous underworld that was explored in Safe In The Hands Of Love. Offering up a dozen pieces of vivid avant-pop (the days when he would fill an album with painterly, semi-concrete ambiences, as he did on 2017’s Experiencing The Deposit Of Faith, appear to have passed).\r\n\r\nCo-produced by Justin Raisen (Sky Ferreira, Ariel Pink, Charli XCX) this selection also comes off as slicker than its predecessor, less prone to rupture and seemingly more comfortable with its poppier impulses. There are even moments here which present as a kind of variation on the neo-soul sound that has been turned murky and swampy at Tumor’s mephistophelian hand. As such, along with Tumor’s disruptive contemporaries like Dean Blunt.\r\n\r\nHeaven To A Tortured Mind finds Yves Tumor growing into his position as an outsider popstar. The result is a beautiful, forthright LP from a supremely unique talent.",
    "buy_link": "https://bleep.com/release/177708-yves-tumor-heaven-to-a-tortured-mind",
    "artist": 44,
    "label": 41,
    "tags": [
      7
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 47,
  "fields": {
    "title": "If You Knew Suzi...",
    "release_year": 1978,
    "artwork": "https://upload.wikimedia.org/wikipedia/en/0/01/Suzi_Quatro_If_You_Knew_Suzi.jpg",
    "description": "If You Knew Suzi... is the fifth regular studio album by Suzi Quatro, released at the end of 1978, but with a 1979 copyright date. By August 2012 this was still Quatro's highest-charting album in the United States. The first single and biggest hit, `If You Can't Give Me Love', is slick, accomplished and catchy.",
    "buy_link": "https://www.discogs.com/Suzi-Quatro-If-You-Knew-Suzi/release/2042967",
    "artist": 45,
    "label": 42,
    "tags": [
      7
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 48,
  "fields": {
    "title": "Harvest",
    "release_year": 1971,
    "artwork": "https://images-na.ssl-images-amazon.com/images/I/51F13AbXjlL._AC_.jpg",
    "description": "Wary of his growing fame and suffering a debilitating back problem, 1971 saw Neil Young retreat from the limelight to record a simple “homey” LP. Oddness followed, with one-armed drumming in old kitchens and the classic mixing instruction “More barn!” shouted from a boat. Unintentionally, Harvest made Neil Young more famous than he’d ever been…",
    "buy_link": "https://www.normanrecords.com/records/112555-neil-young-harvest",
    "artist": 46,
    "label": 43,
    "tags": [
      7
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 49,
  "fields": {
    "title": "Tango in the Night",
    "release_year": 1987,
    "artwork": "https://beatopolis.files.wordpress.com/2014/11/tango-in-the-night.jpg",
    "description": "Tango in the Night is the final album the band would record as an infamous quintet. It’s a pop and production masterpiece, yet remains this monolithic, lucrative idea of a Fleetwood Mac record.",
    "buy_link": "https://www.discogs.com/Fleetwood-Mac-Tango-In-The-Night/release/436642",
    "artist": 47,
    "label": 44,
    "tags": [
      7
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 50,
  "fields": {
    "title": "Masana Temples",
    "release_year": 2018,
    "artwork": "https://f4.bcbits.com/img/a2717866482_10.jpg",
    "description": "The shifting dimensions of Masana Temples, fourth album from psychedelic explorers Kikagaku Moyo,are informed by various experiences the band had with traveling through life together, ranging from the months spent on tour to making a pilgrimage to Lisbon to record the album with jazz musician Bruno Pernadas. The band sought out Pernadas both out of admiration for his music and in an intentional move to work with a producer who came from a wildly different background. With Masana Temples, the band wanted to challenge their own concepts of what psychedelic music could be. Elements of both the attentive folk and wild-eyed rocking sides of the band are still intact throughout, but they’re sharper and more defined.\r\n\r\nMore than the literal interpretation of being on a journey, the album’s always changing sonic panorama reflects the spiritual connection of the band moving through this all together. Life for a traveling band is a series of constant metamorphoses, with languages, cultures, climates and vibes changing with each new town. The only constant for Kikagaku Moyo throughout their travels were the five band members always together moving through it all, but each of them taking everything in from very different perspectives. Inspecting the harmonies and disparities between these perspectives, the group reflects the emotional impact of their nomadic paths. The music is the product of time spent in motion and all of the bending mindsets that come with it.",
    "buy_link": "https://kikagakumoyoggb.bandcamp.com/album/masana-temples",
    "artist": 48,
    "label": 45,
    "tags": [
      7
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 51,
  "fields": {
    "title": "Vol. 4",
    "release_year": 1972,
    "artwork": "https://cdn.shopify.com/s/files/1/1528/8689/products/081227946609_1200x.jpg?v=1523650001",
    "description": "Black Sabbath unleashed the group’s fourth album in two years in 1972 with Vol 4. Stacked with classic tracks like “Supernaut,” “Changes,” and “Snowblind,” the record harnessed the group’s surging popularity to reach the Top 10 on the Albums Chart in the U.K. and the Top 20 on the Billboard 200 in the U.S., on its path to being certified platinum by the RIAA.",
    "buy_link": "https://www.discogs.com/Black-Sabbath-Black-Sabbath-Vol-4/master/4894",
    "artist": 49,
    "label": 44,
    "tags": [
      7
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 52,
  "fields": {
    "title": "Town Centre",
    "release_year": 2019,
    "artwork": "https://img.discogs.com/bodcF8Qt23xzQj8pl7OQAZLgfXM=/fit-in/600x600/filters:strip_icc():format(jpeg):mode_rgb():quality(90)/discogs-images/R-14313545-1585010852-5179.jpeg.jpg",
    "description": "The hotly tipped post-punk, disco-funk phenomenon Squid are back with a new EP called Town Centre which is being released on vinyl via Dan Carey’s Speedy Wunderground label, the first EP from the legendary singles label. Town Centre is a perfect distillation of everything they have done so far, making good on the angular funk of The Dial 7″ (2018) the disco-punk of single Houseplants (2019) the ambitious songwriting of Terrestrial Changeover Blues (2018) and through to their more ambient-leaning early work.\r\n\r\nTown Centre is the most complete body of work they’ve created yet and is not only an enthralling listen, but also serves as a compelling blueprint as to what they can achieve.",
    "buy_link": "https://www.speedywunderground.com/releases/squid-town-centre-ep.html",
    "artist": 50,
    "label": 46,
    "tags": [
      7
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 53,
  "fields": {
    "title": "Schlagenheim",
    "release_year": 2019,
    "artwork": "https://cdn.shopify.com/s/files/1/1391/7125/products/c0b3bf9d-9cf4-4d5c-9f68-1c20e4e810b7_2048x2048.jpg?v=1557760763",
    "description": "black midi -- Geordie Greep   (vocals/guitar),   Matt Kwasniewski-Kelvin  (vocals/guitar), Cameron Picton (vocals/bass), and   Morgan Simpson   (drums) -- have a dynamic energy, playing as a musical unit that’s constantly in a state of flux and development.\r\n\r\nSchlagenheim was recorded with Speedy Wunderground producer Dan Carey, who the band praises for his quick, unfussy approach. black midi laid down eight of the record’s nine tracks in just five days. The process was one of refining and rebuilding tracks around the initial structures. Five hour jams would sometimes yield a riff that then became a few bars of a song. As anyone who’s been lucky enough to catch black midi live over recent months will testify, black midi’s songs are slippery creatures.",
    "buy_link": "https://store.roughtraderecords.com/collections/black-midi/products/black-midi-schlagenheim",
    "artist": 51,
    "label": 47,
    "tags": [
      7
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 54,
  "fields": {
    "title": "Bossanova",
    "release_year": 1990,
    "artwork": "https://cf-cdn.beggars.com/fourad/site/images/releases/packshots/5ee7aaf41065b.jpg",
    "description": "The surf rock-space rock hybrid that is Bossanova did a lot of foundational work for the Pixies and would go on to confirm them as classic alternative rock musicians. The duality of the record is one thing but the real push comes from the Pixies ability to make these many different factions thread into one consistent rope of rock.\r\n\r\nBossanova acts as the moment the Pixies not only found their voice but tapped into all of their musical senses.",
    "buy_link": "https://4ad.com/releases/925",
    "artist": 52,
    "label": 48,
    "tags": [
      7
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 55,
  "fields": {
    "title": "Goo",
    "release_year": 1990,
    "artwork": "https://upload.wikimedia.org/wikipedia/en/b/b2/Sonicyouthgoo.png",
    "description": "It’s difficult to imagine the alt.rock explosion of the 90s happening without Sonic Youth first cracking the door open. A defining album for a new era, Goo challenged the idea of what a mainstream rock album could be without sacrificing the experimental, cacophonous tendencies that earned them a devoted cult following.",
    "buy_link": "https://www.discogs.com/Sonic-Youth-Goo/master/9751",
    "artist": 53,
    "label": 49,
    "tags": [
      7
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 56,
  "fields": {
    "title": "Jessica Pratt",
    "release_year": 2012,
    "artwork": "https://images-na.ssl-images-amazon.com/images/I/41yzwTju56L._AC_.jpg",
    "description": "The new folk sensation from the States on Tim (White Fence) Presley's new label Birth Records.\r\n\r\n“I never wanted to ever start a record label. Ever. But there is something about her voice I couldn't let go of. It's an actual voice. An actual beautiful voice. This ones a classic sounding voice. Not to mention her song writing, recording and guitar playing. Jessica Pratt's music feels like I have found a lost LP of an old forgotten mystical folk singer, that feeling of discovering a record all by myself: Without the help of friends or the Internet. Like Stevie Nicks singing over David Crosby demos, with the intimacy of a Sibylle Baier. I am in love with it. So much, that I saved up and threw all my money to get it into this world. I actually care about it, no matter which way the winds blow.” - Tim Presley, White Fence.",
    "buy_link": "https://www.piccadillyrecords.com/counter/product.php?pid=86841",
    "artist": 54,
    "label": 50,
    "tags": [
      7
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 57,
  "fields": {
    "title": "Loos In Twos (NRG)",
    "release_year": 2020,
    "artwork": "https://f4.bcbits.com/img/a1003079422_10.jpg",
    "description": "Anz makes her Hessle Audio debut with a club-ready three track EP, following releases on the label by Pearson Sound and Pangaea in July. Lead track 'Loos In Twos (NRG)' goes turbo, with a ruffneck bassline, clattering breakbeats and dramatic rave stab breakdowns all combining to memorable, killer effect. On the B side, 'Gary Mission' gets loose with disorientating flanged FX and a wriggling low end, with the minimal beat track 'Stepper' using sharp vocal snippets and chest-rattling sub to light up the dance.\r\n\r\nAnz is a DJ and Producer based in Manchester (via London, Liverpool and Madrid). Renowned for her genre-spanning productions and mixes, she unearths the links between Electro, UK Garage, Jungle and more, underpinning a versatile take on contemporary UK club music that is as bright as it is unpredictable.",
    "buy_link": "https://anzdj.bandcamp.com/album/loos-in-twos-nrg",
    "artist": 55,
    "label": 51,
    "tags": [
      8
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 58,
  "fields": {
    "title": "Fire Kit EP",
    "release_year": 2020,
    "artwork": "https://f4.bcbits.com/img/a1265302084_10.jpg",
    "description": "Hessle Audio welcome Laksa to the label with three tracks of rowdy and forward-thinking dance music, following his last release on Timedance in September.\r\n\r\nOn the A-side, ‘Fire Kit’ sees the London-based producer and DJ approaching his sound from a different direction, with dancehall infused percussion offset by enveloping layers of sub-bass warmth at 95bpm.\r\nThe B side jacks up the tempo with a raucous energy as the temperature drops to below freezing. Basslines rumble in ‘Belly Brocka’ and ‘T’s Tent’ like an approaching storm and snares lash through the mix like ice picks, with the broken rhythmic energy driving the dance forward in 2021 and beyond.\r\n\r\nRunning the club night and monthly NTS show ‘re:lax’ with re:ni, Laksa has been consistently pushing bass mutations since his early EPs on Beneath’s Mistry label. A Bristol bass bobbler at heart, his hybrid sound has found a home on many respected labels such as Timedance, Ilian Tape and Whities, cementing his place amongst the latest UK talent.",
    "buy_link": "https://laksa.bandcamp.com/album/fire-kit-ep",
    "artist": 56,
    "label": 51,
    "tags": [
      8
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 59,
  "fields": {
    "title": "Misnakes / Digidub",
    "release_year": 2019,
    "artwork": "https://f4.bcbits.com/img/a0278901946_10.jpg",
    "description": "Josi Devil, aka JD, the enigmatic producer behind the Rules of the Dance remix featured on Kahn and Neek’s fabric mix - returns with a double 12” and two absolute melters. the rounds with the likes of L U C Y, Commodo & Sir Hiss while Misnakes is a different beast and possibly the coldest release on Scrub a Dub to date.",
    "buy_link": "https://scotchbonnetrecords.bandcamp.com/album/digidub-misnakes",
    "artist": 57,
    "label": 52,
    "tags": [
      8
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 60,
  "fields": {
    "title": "Warm Body EP",
    "release_year": 2020,
    "artwork": "https://f4.bcbits.com/img/a0994382738_10.jpg",
    "description": "Well Street welcome Dublin-based Sputnik One to the label who comes with 4 heavy hitting, versatile drum tools spanning 90 - 130bpm.",
    "buy_link": "https://wellstreetrecords.bandcamp.com/album/warm-body-ep",
    "artist": 58,
    "label": 53,
    "tags": [
      8
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 61,
  "fields": {
    "title": "Hex / Fatalist",
    "release_year": 2011,
    "artwork": "https://assets.boomkat.com/spree/products/153589/large/original.jpg",
    "description": "Ultra-crisp, hard-bodied future flexes from Pangaea, dropping one of his deadliest singles to date. The man's hardly known for his high work rate, releasing only a handful of records since he started in 2008, but he's evidently born of a rare breed who exert exacting quality control over their music, hence one of the most definitive catalogues in the modern Bass music canon. Disciplined, and distinctively rooted rhythmic control coupled with the keenest production values keep his tracks timelessly futurist, and no more so than 'Hex', a tautly syncopated and wickedly weighty ragga-jungle update infused with the nattiest chat and sci-fi dread synths to invigorating standards. The flip to this is 'Fatalist', an equally robust and dutty swinger, keeping the pressure locked deeper in the pocket with shredding drum shuffles and an LFO tweaked bassline begging for badman/gyal behaviour on the 'floor. Killer.",
    "buy_link": "https://boomkat.com/products/hex-fatalist-0206351e-250f-4494-b26d-0d7bf8e329ab",
    "artist": 59,
    "label": 54,
    "tags": [
      8
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 62,
  "fields": {
    "title": "Garden of E10",
    "release_year": 2020,
    "artwork": "https://f4.bcbits.com/img/a0483230051_10.jpg",
    "description": "The 6 Figure Gang member unveils her highly anticipated first official single.",
    "buy_link": "https://szns7n.bandcamp.com/",
    "artist": 60,
    "label": 55,
    "tags": [
      8
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 63,
  "fields": {
    "title": "Sharpen, Moving",
    "release_year": 2020,
    "artwork": "https://f4.bcbits.com/img/a2163956216_10.jpg",
    "description": "'Sharpen, Moving' celebrates five years of the Timedance imprint, blending the labels original aesthetic and opening it up into new corners of leftfield club music. Artists featuring include the regular faces of Batu, Bruce, Ploy and Metrist, alongside newcomers Kit Seymour, Akiko Haruna and Mang & GRAŃ. Timedance also welcomes techno royalty Peter Van Hoesen with one of his most broken tracks to date, plus new appearances from Patina Echoes contributors Via Maris, Cleyra and Nico.\r\n\r\nThe compilation showcases Timedance's evolution from 'Bristol techno' to a more global conscious sound, incorporating energies from different scenes and synthesising them into new modern forms.",
    "buy_link": "http://www.timedancemusic.com/releases/timedance-023-sharpen-moving/",
    "artist": 61,
    "label": 56,
    "tags": [
      8
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 64,
  "fields": {
    "title": "Witness",
    "release_year": 2020,
    "artwork": "https://f4.bcbits.com/img/a3090402507_10.jpg",
    "description": "One of the UK’s most respected electronic artists, Al Wootton (formerly known as Deadboy) presents his first album under the Al Wootton name, Witness.\r\n\r\nSince emerging in 2009, Wootton has been behind some of the biggest dance records of the last decade, releasing on labels like Numbers, Local Action and Aus Music. In 2019, he re-located from London to the seaside town of Ramsgate (following a period spent in Montreal) and re-branded under his birth name, building a home studio and honing a style of dance music that draws heavily from his long-term loves of garage and dub.\r\n\r\nWootton has enjoyed a rich run of form since going back to basics: he’s released five 12”s in two years through his Trule label, copies of which now swiftly sell out as standard, and has also expanded the label to house releases by Melbourne producer Pugilist and old foil Julio Bashmore. On Witness, he channels this focus and momentum into an 8-track album that explores techno, garage, jungle and more, all tied together by the dub-inspired effects and atmosphere that has characterised his Al Wootton records to date.",
    "buy_link": "https://www.unearthedsounds.co.uk/products/al-wootton-witness-12-vinyl-lp",
    "artist": 62,
    "label": 57,
    "tags": [
      8
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 65,
  "fields": {
    "title": "Slipping",
    "release_year": 2019,
    "artwork": "https://f4.bcbits.com/img/a1830492759_10.jpg",
    "description": "Joy Orbison nimbly bridges London club sounds in a strong new refinement and loosening of his style for Hinge Finger, the label he runs with TTT’s Will Bankhead.\r\n\r\nBringing members of his home city’s jazz and soul scene, Mansur Brown and Keyah Blu, to a series of warped house, trip hop and experimental cuts alongside NYC’s Infinite, Joy O pointedly makes a transition into more textured, freeform and psychedelic/soulful frameworks after a decade of knocking out definitive UK club standards.\r\n\r\nRounding up six diverse productions, ‘Slipping’ is as close as you’ll get to an album from Joy O, for now at least. From the charmingly scrappy but soulful intro to ‘Burn’, which soon turns into an irresistibly deep and technoid garage workout, to the Flying Lotus-like dexterity of ‘While She’s Away’, the session naturally scales between tempos and vibes is a very satisfying way, dipping to Tricky-meets-Tirzah-esque R&B/trip-hop on ‘Under’ ft. Keyah Blu, and taking in fuzzy, summery ambient nostalgia ‘w Dad’, plus a wickedly abstract sort of hardcore dembow stance on ‘Breathe In’, and a sweetly sun-blushed slice of ambient rare grooving in ‘Walworth Waltz’ ft. Mansur Brown.\r\n\r\nMuch more than a pure dancefloor set, this one’s for the journey.",
    "buy_link": "https://tossportal.bandcamp.com/album/slipping",
    "artist": 63,
    "label": 58,
    "tags": [
      8
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 66,
  "fields": {
    "title": "Pleats Plead EP",
    "release_year": 2019,
    "artwork": "https://f4.bcbits.com/img/a3886828361_10.jpg",
    "description": "Based in Melbourne, Plead’s Lebanese heritage inspires much of his output, resulting in steely, powerful drum work-outs often spiked with the rhythms and timbres of Lebanese pop and traditional Lebanese wedding music. Blending these with a hybrid mix of contemporary RnB, hard-drum and other more breakout dance styles. On ‘Pleat’s Plead’, he pushes his sound further than ever before too, stripping individual elements back to deliver a record bursting with boisterous, industrial energy. Under the guidance of label heads TSVI and Wallwork, he embeds his signature palette – Lebanese flutes, Mijwiz, vocal samples and subtle padwork – within a ruff-and-tuff drum-track framework, keeping things breathless from start to finish.",
    "buy_link": "https://nervoushorizon.bandcamp.com/album/dj-plead-pleats-plead-ep",
    "artist": 64,
    "label": 59,
    "tags": [
      8
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 67,
  "fields": {
    "title": "Send Them To Coventry",
    "release_year": 2020,
    "artwork": "https://i1.sndcdn.com/artworks-FfcXlRa77mnp-0-t500x500.jpg",
    "description": "Pa Salieu’s ‘Send Them To Coventry’ is a scorching debut project from UK rap’s new golden boy.\r\n\r\nDespite still being in a relatively early stage of his career, the Coventry rapper already possesses a star factor which makes him hard to ignore. His ability to switch between drill, hip hop, Afrobeats, and melody-driven styles with ease makes him a perfect artist for the modern generation of rap.\r\n\r\nA little over a year since waking up in intensive care after being shot in the head, Coventry’s breakout star Pa Salieu stakes a claim to being the most exciting rising talent in UK rap. The mixtape boasts some previously unheard collaborations with M1llionz on ‘Informa’, Mahalia on ‘Energy’, and Trinidadian artist Boy Boy on ‘No Warnin’, while production from the likes of Felix Joseph, AOD, Jevon, Yussef Dayes and slowthai collaborator Kwes Darko, assures that Salieu’s blistering sound is done justice.",
    "buy_link": "https://lnk.to/SendThemToCoventry",
    "artist": 65,
    "label": 60,
    "tags": [
      9,
      10
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 68,
  "fields": {
    "title": "They Don't Know",
    "release_year": 2001,
    "artwork": "http://s3.amazonaws.com/quietus_production/images/articles/28201/8558464_1589442165_crop_550x539.jpg",
    "description": "The gaps between musical genres are painted in fuzzy shades rather than smart geometrical lines, making it nigh-on impossible to tell where one ends and another begins. This, on the whole, is a good thing. But it means the true pioneers can sometimes fall between the gaps. So Solid Crew, a collective of MCs and producers from South London, arguably fell victim to this fate: too early for the grime explosion and too late for UK Garage, their place in history is uncertain, even as grime bursts with millennial health.\r\n\r\nThey Don’t Know was a brilliant riposte to anyone who might have thought that topping the singles chart had gone to So Solid’s heads. Sure, the album had hooks, from the nagging vocals on the title track (a song that appears to be composed of about 50% choruses and 45% swagger) to the maddening synth/bass riff call and response on 'Woah'. But it was as hard as a Bermondsey foundry, oozing with the same sub bass, distorted synth lines and serrated drum hits that had made 'Dilemma' such a musical slap in the face. There can be few multi-platinum albums in history that made such a virtue of their crude sonic force.\r\n\r\nThey Don’t Know was hugely experimental in its production too, with the drums (especially) pointing the way towards grime. UK Garage and its 2-step offshoot might have dabbled initially in experimental drum programming but by 2001 many of the more commercial UKG songs were built on predictable drum patterns. The drums on They Don’t Know – and especially on songs like 'If It Was Me' and 'Deeper' – were all over the place and fearsomely funky, nodding to dancehall, 2-step, house and hip hop without ever bending a knee to one genre, in a way that Dizzee Rascal would take up on Boy In Da Corner two years later.",
    "buy_link": "https://www.discogs.com/So-Solid-Crew-They-Dont-Know/release/115228",
    "artist": 66,
    "label": 61,
    "tags": [
      8
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 69,
  "fields": {
    "title": "White Label Classics",
    "release_year": 2012,
    "artwork": "https://f4.bcbits.com/img/a0229049053_10.jpg",
    "description": "A definitive collection of Ruff Sqwad's legendary instrumentals from 2002-7 that were hugely significant in shaping the grime sound.\r\n\r\nIn the early to mid 2000s, before grime became a household name, before number 1 singles and international shows, a group of teenage producers, MCs and DJs from Bow mostly school-friends created a sound, and a name for themselves, that will stand the test of time. Whittled down from over 50 legendary instrumentals to 22, 'these are the anthems, the tunes people remember us by. The ones people have been asking for ever since.'",
    "buy_link": "https://nohatsnohoods.bandcamp.com/album/white-label-classics",
    "artist": 67,
    "label": 62,
    "tags": [
      9
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 70,
  "fields": {
    "title": "Gotcha",
    "release_year": 2020,
    "artwork": "https://t2.genius.com/unsafe/440x0/https%3A%2F%2Fimages.genius.com%2Fac66501ed92b3aeb31aab6a1437ffbe2.1000x1000x1.png",
    "description": "Fashioning an artistic international tie which merges two cultures and still pays homage to the UK rap/drill scene; two of the UK's biggest rising stars Unknown T and Digga D have collaborated with Jamaica's King of Dancehall Vybz Kartel to bring us 'Gotcha' their new chilly UK drill-beat song.\r\n\r\nWith sounds provided UK producer and music engineer Sean D this explosive new tune has brought together a first time collaboration never before seen from the two UK artists. Having released some of the strongest sounds this year including 'Woi' and 'Chingy' from Digga D and Unknown T's 'Rise Above Hate' album this only adds to the rappers' impeccable discographies.\r\n\r\nSpeaking on the track Sean states: \"The concept of a Jamaican basement/reggae artist on drill excited me as it hasn't been done yet. Being a massive fan of Vybz Kartel, he was the go to artist to start the concept - I sent him the instrumental and he laid a verse and chorus on the track. I reached to T and Digga as I thought they'd be the perfect match\".",
    "buy_link": "https://open.spotify.com/album/610mjyWnCbxvgSa2AqvKiz?si=Nf9vq_EUT1ybw4kwIqZ1_g",
    "artist": 68,
    "label": 63,
    "tags": [
      9
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 71,
  "fields": {
    "title": "Konnichiwa",
    "release_year": 2016,
    "artwork": "https://d1c4rk9le5opln.cloudfront.net/42a7ee898a2cbfcd541b6983ca477190.jpg",
    "description": "A landmark in British street music that takes on the world without compromising one inch of its grime core.\r\n\r\nMercury Music Prize Winning album 2016. One of the most influential albums of this generation, on the legendary Boy Better Know imprint.",
    "buy_link": "https://www.phonicarecords.com/product/skepta-konnichiwa-lp-boy-better-know/144344",
    "artist": 69,
    "label": 64,
    "tags": [
      9
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 72,
  "fields": {
    "title": "Kid U / Lost My Marbles",
    "release_year": 2015,
    "artwork": "https://f4.bcbits.com/img/a2078932452_10.jpg",
    "description": "Tarquin debuts on Mr. Mitch's Gobstopper with a wickedly schizoid grime sound. Following equally mercurial winners from Loom, Iglew and Social State, these two explore instrumental grime's oddest ends. 'Kid U' works at a sweetboy halfstep roll with bubbling vocal idents dancing around shearing metallic synths and pizzicato strings whipped up like some Murlo spesh. On the other hand, 'Lost my Marbles' is utter insanity, augmenting a nasty bassline-style chassis with cranky drops and toad croak tone to bomb the dance. Tip!",
    "buy_link": "https://boomkat.com/products/kid-u-lost-my-marbles",
    "artist": 70,
    "label": 65,
    "tags": [
      9
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 73,
  "fields": {
    "title": "Landlord",
    "release_year": 2016,
    "artwork": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2016/08/11/21/qhy0jnla.jpg?width=990&auto=webp&quality=75",
    "description": "'Landlord' is fantastic, crafted, big-stage trap with the lissom, conversational feel of a mixtape. The clever use of features offsets that lugubrious voice with a pleasing range of articulate rappers; and the beats intelligently mix intimacy and claustrophobia, making Giggs’s grownup rhymes more authoritative than ever. Drake-aping Of Course is more drizzly than Drizzy, but adds light to the usual shady south London bad-boy bars of bangers Lock Doh and Whippin Excursion. “They call me the landlord / Come and get your keys cut,” he gruffs, and it’s fabulously half-hilarious, half-terrifying.",
    "buy_link": "https://www.banquetrecords.com/giggs/landlord/SN1001",
    "artist": 71,
    "label": 66,
    "tags": [
      9
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 74,
  "fields": {
    "title": "Pessimist & Karim Maas",
    "release_year": 2019,
    "artwork": "https://f4.bcbits.com/img/a1492866913_10.jpg",
    "description": "Pessimist links with longtime associate Karim Maas for twelve untitled, interconnected tracks of paranoid, dub-fissured hip-hop and voidal techno pressure. Forget dnb…this is a downer than downtempo excursion, deep and dread, heavy as a jeep parked on your chest, with low-slung, blunted breakbeats and weapons-grade sub-bass caught up in whirlpools of dissolve and decay and baleful, insinuating drone...yeah at times it feels less like a record and more like a bona fide AIRBORNE TOXIC EVENT. Intricate, elegant, its chillin-with-the-wrong-b-boy mood fantastically sustained, It conquers territory that previous Pessimist and Maas solo productions have only hinted at, connecting with the Isolationist/industrial traumascapes/infinite-comedown of 90s E.A.R./Köner, Main and SAW II, the enveloping neo-noir of Plastikman’s Consumed, the crackle-and-hiss materiality of Rhythm & Sound and Pole, the thermonuclear rack and ruin of Lustmord's Stalker. Just the baddest vibes...Music to get lost - real lost - inside.",
    "buy_link": "https://www.lowcompany.co.uk/products/pessimist-karim-maas",
    "artist": 3,
    "label": 3,
    "tags": [
      3
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 75,
  "fields": {
    "title": "Where This Leads",
    "release_year": 2020,
    "artwork": "https://f4.bcbits.com/img/a2404277548_10.jpg",
    "description": "One of the most interesting things about Carlton Melton’s music is that it is split in two. On each album, from debut Country Ways onward, there lives a restless conflict between different approaches: the experimental, the avant-garde and the improvisatory jostles for space with some of the more conventional tropes of heavy rock such as bludgeoning riffs and structured songwriting. Where This Leads, the San Francisco band’s seventh LP, is particularly divided within itself, and it makes for arguably their most compelling and original work yet.",
    "buy_link": "https://meltoncarlton.bandcamp.com/album/where-this-leads",
    "artist": 72,
    "label": 67,
    "tags": [
      7
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 76,
  "fields": {
    "title": "Ghostride The Drift",
    "release_year": 2019,
    "artwork": "https://f4.bcbits.com/img/a3425292958_10.jpg",
    "description": "Ghostride The Drift is a highly promising new smudge-ambient project dreamt by Huerco S, Exael and Special Guest DJ aka uon, for his and D. Tiffany’s new label.\r\n\r\nTheir extended self-titled debut finds the trio’s shared tastes consolidated and mutated in 5 parts of spiralling, psychedelic and elusive dub forms that evoke the sensation of floating in a fog-choked rave at 5AM.  Finding range between pockets of noisy dub ephemera, tracts of scudding, weightless hyper-dub, and seductively dragging downbeats, the EP speaks to each producer’s sound in turn and all at once. \r\n\r\nThe opening blast of fathoms-deep, gaseous iridescence and buried but pelting kick drums is a huge highlight, recalling Xth Reflexion joints for Aught, while moments of Basic Channel-esque abstraction colour the downtime between beats, variously rolling out with brownian motion, and then a sluggish ruggish ’90s ambient appeal one can imagine soundtracking a thousand dawns this summer and beyond...",
    "buy_link": "https://xpqsound.bandcamp.com/album/ghostride-the-drift",
    "artist": 73,
    "label": 68,
    "tags": [
      3,
      12
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 77,
  "fields": {
    "title": "Dioxippe",
    "release_year": 2019,
    "artwork": "https://f4.bcbits.com/img/a1086788279_10.jpg",
    "description": "After turning some heads with a debut drop from Ghostride The Drift, D. Tiffany and Special Guest DJ’s xpq? imprint invite GTD member Exael back for a second bite of the cherry. On Dioxippe the Berlin-based producer comes through with a set of MIDI malfunctions that flit between beat-driven techno, experimental electronics and acidic deconstructions. Cuts like the title track and ‘cyl reedit’ have a warped and scuzzy feel to them that one also finds in the output of artists like Bergsonist and Metrist. The machines make their presence felt throughout Dioxippe, be they chattering maniacally (‘untitled’) or hissing malevolently (‘rond’).",
    "buy_link": "https://xpqsound.bandcamp.com/album/dioxippe",
    "artist": 74,
    "label": 68,
    "tags": [
      4,
      12
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 78,
  "fields": {
    "title": "Junk DNA",
    "release_year": 2020,
    "artwork": "https://f4.bcbits.com/img/a2000014260_10.jpg",
    "description": "Mysterious “married outlaws” Low Budget Aliens firm up a killer sort of (I)DeMaterialised spin on drill, jungle, footwork and ruff bass sound for D. Tiffany and uon’s XPQ? label\r\n\r\n‘Junk DNA’ spells out a dead crafty sound in orbit somewhere between early Actress, the ambient dance mutations of Ghostride The Drift and Skee Mask’s nervy rufige. It’s smudged regurgitations are pretty much bang on the pulse for contemporary music’s up-in-the-air flux of styles in a way that feels like it could go in any of ten directions at once. \r\n\r\n‘CRASh LANDING’ kicks it off with a sort of radioactive rendering of drill, and ‘Hazardous Waste Pump’ turns up the gas on a slowfast jungle tip, teeing up a weightless flex shared wrth the centrifugal footworking dynamics of ’FE Ignot’ and what sounds like a vaporised 33EMYBW in ‘HOME SICK!’, while ‘BOWSERS HIGHT COURT’ leans into X-files breakcore, and the deadly one-two of ‘Service Mode 2’ and ‘LEVEL 1 2 3 4’ whip D&B and 150bpm beat science into wilder, experimental dancefloor thrills.",
    "buy_link": "https://xpqsound.bandcamp.com/album/junk-dna",
    "artist": 75,
    "label": 68,
    "tags": [
      5,
      12
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 79,
  "fields": {
    "title": "Critical Amnesia",
    "release_year": 2020,
    "artwork": "https://f4.bcbits.com/img/a0654159612_10.jpg",
    "description": "With the release of Critical Amnesia’s self-titled EP, Berlin’s strangest dancefloor occupiers XPQ? prove yet again that they’re incapable of releasing anything tied to this planet. Critical Amnesia is masterfully made by unseen hands, each track given a catalogue-like number as a title to accompany the broken breakbeat and techno within. ‘NS0S1’ belies a desire to send bodies moving, while ‘0DSN1’ and its discordant sequels would rather leave the entire club scratching their heads.",
    "buy_link": "https://xpqsound.bandcamp.com/album/critical-amnesia",
    "artist": 76,
    "label": 68,
    "tags": [
      3,
      12
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 80,
  "fields": {
    "title": "Nothing More To Say",
    "release_year": 2012,
    "artwork": "https://f4.bcbits.com/img/a1719205650_10.jpg",
    "description": "On Sophie's first proper release, the dance producer has created a shimmery and decidedly retro electro-house gem. \"Nothing More to Say\" surfaced in different forms last year, but this latest version, an interpretation of the single's sides as one track, is sharper from start to finish.",
    "buy_link": "https://sophiemsmsmsm.bandcamp.com/track/nothing-more-to-say-dub",
    "artist": 77,
    "label": 69,
    "tags": [
      4,
      13
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 81,
  "fields": {
    "title": "Lemonade / Hard",
    "release_year": 2014,
    "artwork": "https://f4.bcbits.com/img/a3027868264_10.jpg",
    "description": "SOPHIE returns with a new single of feisty, sugar-high bass contortions for Numbers. 'Lemonade' lurches between minimal blips and all out, maximal pop fireworks, its squeaky clean sound somehow making the whole thing more unpredictable and wild. Over on the flip 'Hard' is all toying vocals and sharp, candy-coloured edges, bass high kicks and glossy synths pulled into an excitable whole. Yet another knockout release from the producer.",
    "buy_link": "https://nmbrs.bandcamp.com/album/lemonade-hard",
    "artist": 77,
    "label": 70,
    "tags": [
      3,
      13
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 82,
  "fields": {
    "title": "OIL OF EVERY PEARL'S UN-INSIDES",
    "release_year": 2018,
    "artwork": "https://f4.bcbits.com/img/a1763729468_10.jpg",
    "description": "With her debut album OIL OF EVERY PEARL'S UN-INSIDES, SOPHIE very much achieved her unique aim of making music that sits perfectly on the radar of nationwide mainstream radio appeal, yet turned it on its head by smuggling in some very rubbery and experimental latex clad ideas of what makes commercial pop music something for people to fetishise to the nth degree. This is the sort of album we can see bursting any preconceptions and made up minds on what makes SOPHIE's music such an addictive pill to swallow.\r\n\r\nAt this point SOPHIE's under and overground dominance is pretty much untouchable really, she has worked with everyone from Diplo to Madonna and was scouted for Jay-Z's talent agency Roc Nation. Yet she also cites Autechre as heroes and is mates with Glasgow's Numbers crew. What other artists can you really name who can easily move in both circles? Until Madonna swings by Rubadub to score some techno wax the next time she plays in Glasgow we'd say pretty much no one.\r\n\r\nWhile it's a very dividing record its strength is in its confidence to take traditional pop music to the outer edges and then some, and while you may not like all of it. It's a damn site more boundary pushing than the million and one bedroom producers knocking out dusty house and techno trax each week.",
    "buy_link": "https://bleep.com/release/103882-sophie-oil-of-every-pearls-un-insides",
    "artist": 77,
    "label": 71,
    "tags": [
      3,
      13
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 83,
  "fields": {
    "title": "BIPP (Autechre Mx) / UNISIL",
    "release_year": 2021,
    "artwork": "https://d1rgjmn2wmqeif.cloudfront.net/r/b/217954.jpg",
    "description": "It turns out that SOPHIE and Autechre’s eventual pairing was down to fate. Before SOPHIE became the global arbiter of hyperkinetic pop futurism, the budding bedroom producer acquired a leaked Autechre live recording from 2007 — a document of an explorative phase between Untilted and Quaristice — and promptly sought the hardware they utilised. In a striking turn of historical interplay, those leaked recordings came to inform aspects of the off-kilter club atmospherics of her debut compilation, Product.\r\n\r\nA remix was bound to happen. Autechre morph the mega-endorphin influx of the original ‘BIPP’ into a luxurious, syrupy pour; SOPHIE’s diva hook is re-pitched to a chopped and screwed swing, as a plethora of fine percussive detail — an errant hi-hat here, a digitised tom accentuation there — fills the indices between the rave-indebted bass climbs.\r\n\r\nRecorded in SOPHIE’s Product days but never given its own release, ‘UNISIL’ is pure menace and mischief. Driven by a grizzly electronica pace and a cheerleader’s “hey”-handclap melee, the track is a potent narcotic made from soundsystem breaking techno and the producer’s penchant for finding the pop even in the darkest of places.\r\n\r\nAn unforeseeable historical cycle surges through this release, as Autechre simultaneously nod toward their own legacy in addition to the immanence of SOPHIE’s.\r\n\r\nRest in Power SOPHIE.",
    "buy_link": "https://bleep.com/release/217954-sophie-bipp-autechre-mx-unisil",
    "artist": 77,
    "label": 70,
    "tags": [
      3,
      13
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 84,
  "fields": {
    "title": "Information (Redacted)",
    "release_year": 2021,
    "artwork": "https://f4.bcbits.com/img/a0176914704_10.jpg",
    "description": "Following his 2019 Ghostly International debut, Information, Galcher Lustwerk backed it up with Proof; and now, the Cleveland-raised, New York-based producer opens the confidential files for one last exposé, a collection of instrumentals called Information (Redacted). The album revisits material from both the LP and EP, removing Lustwerk's vocals from the strobe-lit haze, forgoing the truth in service of the vibe. The facts further obscured but robustly operative, here more instinctive and open to interpretation. These are low key dance productions, some slowed to dubby, hypnotic effect (“Thermonics,” “Left In The Dark”), others set loose in the night with no narrative guide. The instrumental format reveals Lustwerk’s control of tone and mood, his nuanced use of drums, and his clever knack as an arranger. Though his work was always ready for the club, these pieces become less dramatic than their first iterations and opt to be more primed for implementation at the decks, if even just in your living room. Two tracks on the back half are new — “Warming Up” and “Waltz” — the former finds Lustwerk at his loungiest, the latter closes the collection in an ambient organ coda.",
    "buy_link": "https://galcherlustwerk.bandcamp.com/album/information-redacted",
    "artist": 78,
    "label": 72,
    "tags": [
      4,
      11
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 85,
  "fields": {
    "title": "Galerie",
    "release_year": 2020,
    "artwork": "https://f4.bcbits.com/img/a1499689320_10.jpg",
    "description": "Posh Isolation is proud to present ”Galerie” by the Copenhagen based Scotsman Perko. While being mostly recognized for his organic blend of club music arrangements, “Galerie” emphasises a focus on field recordings, textures and striped-down abstraction. Over the course of 8 tracks Perko builds small worlds of tangible ambience and horizons of amiable beauty. The sense of ebb and flow throughout “Galerie” gives it a sense of contemplative weightlessness and the perception of mild sun glittering blindness.",
    "buy_link": "https://perko.bandcamp.com/album/galerie",
    "artist": 79,
    "label": 73,
    "tags": [
      3,
      11
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 86,
  "fields": {
    "title": "Ruff Dog",
    "release_year": 2020,
    "artwork": "https://f4.bcbits.com/img/a3708523859_10.jpg",
    "description": "In a striking stylistic return to their avant-pop roots — first seeded as Micachu and The Shapes (later renamed Good Sad Happy Bad) — Ruff Dog sees the composer Mica Levi rejecting the sweep of cinematic strings found in her scores for Jackie or Under The Skin and embracing the immediacy of lo-fi pop, without sacrificing the meticulous detail consistent throughout their esoteric career.\r\n\r\nThis is Levi’s first proper solo release, but in typically irreverent fashion, they nimbly eschew the prerequisite amount of intimacy by playing fast and loose with distorting textural qualities; distantly echoing vocals, scorched guitar distortion, and a warm blanket of tape hiss. The rock song skeletons of ‘Kind of Strange’ and ‘One Tear’ are slyly obscured by a torrent of fuzz, while the sounds of domesticity — a phone alarm, or the album’s titular dog — become an ersatz backing band on the likes of ‘Chains Baggy’. The sonic ethos is at its most evocative on ‘Wings’, sounding heavily like a cut from an early My Bloody Valentine session.\r\n\r\nEven with this much inscrutability, Ruff Dog succeeds in feeling like a deeply personal record granting the listener a glimpse into Levi’s world.",
    "buy_link": "https://micalevi.bandcamp.com/album/ruff-dog",
    "artist": 80,
    "label": 74,
    "tags": [
      7,
      11
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 87,
  "fields": {
    "title": "Boy In da Corner",
    "release_year": 2004,
    "artwork": "https://is3-ssl.mzstatic.com/image/thumb/Music114/v4/81/1c/c8/811cc88c-ade5-2da1-0645-c3af3004cc3f/source/600x600bb.jpg",
    "description": "Already a true classic and incredibly important album, Dizzee Rascal’s game changing debut 2003 LP Boy In Da Corner crystallizes the sounds, moods and surroundings of the UK’s inner-city in a way that ensures underground hip-hop and grim will never be the same again. Dizzee’s wailing, concentrated anger manifests itself as cut-throat lyrics delivered with precision, taking on a greater intensity once going head to head with the gritted wobble bass of ‘Stop Dat’ and creeping beats on ‘2 Far’. Big, bold statements are made on the classics ‘Fix Up Look Sharp’ and ‘Jus A Rascal’ but it's the harsher ‘Seems 2 Be’ and ‘Live O’ where Dizzee really rips up the rulebook and opens up a new path.",
    "buy_link": "https://bleep.com/release/1753-dizzee-rascal-boy-in-da-corner",
    "artist": 81,
    "label": 75,
    "tags": [
      9
    ],
    "favourited_by": []
  }
},
{
  "model": "releases.release",
  "pk": 88,
  "fields": {
    "title": "Integrity>",
    "release_year": 2015,
    "artwork": "https://crackmagazine.net/wp-content/uploads/2015/06/71BnHp7rRGL._SL1400_.jpg",
    "description": "A man whose career we've followed for a while, from the raw youtube videos from his Boy Better Know crew, to a top 10 album, JME has always grabbed attention. On this highly personal album we hear of his route so far to achieve the position he holds today, shunning major label offers to keep his personal brand and style intact and under his control. We have a lot of respect for Jamie Adenuga and Integrity shows of all of his talents and maintains his relevance in today's grime spectrum.",
    "buy_link": "https://bleep.com/release/60455-jme-integrity",
    "artist": 82,
    "label": 64,
    "tags": [
      9
    ],
    "favourited_by": []
  }
}
]
